# pandas_tutorial_2

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("D:\\tala\\pandas\\chicago.csv")
#df["Department"]=df["Department"].astype("category")
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1002.1+ KB

In [4]:
df.nunique()

Name                      31776
Position Title             1093
Department                   35
Employee Annual Salary     1156
dtype: int64

In [5]:
df["Department"].unique()

array(['WATER MGMNT', 'POLICE', 'GENERAL SERVICES', 'CITY COUNCIL',
       'STREETS & SAN', 'OEMC', 'AVIATION', 'FIRE', 'FAMILY & SUPPORT',
       'IPRA', 'PUBLIC LIBRARY', 'BUSINESS AFFAIRS', 'TRANSPORTN',
       'HEALTH', "MAYOR'S OFFICE", 'LAW', 'FINANCE', 'CULTURAL AFFAIRS',
       'COMMUNITY DEVELOPMENT', 'BUILDINGS', 'ANIMAL CONTRL',
       'CITY CLERK', 'BOARD OF ELECTION', 'INSPECTOR GEN', 'TREASURER',
       'DISABILITIES', 'HUMAN RESOURCES', 'DoIT', 'BUDGET & MGMT',
       'PROCUREMENT', 'HUMAN RELATIONS', 'BOARD OF ETHICS',
       'POLICE BOARD', 'ADMIN HEARNG', 'LICENSE APPL COMM', nan],
      dtype=object)

In [6]:
df["Department"]=df["Department"].astype("category")

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32063 entries, 0 to 32062
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 784.2+ KB

# lower() , upper() ,title()

In [8]:
"HAMED AHMADI".lower()

'hamed ahmadi'

In [9]:
"hamed ahmadi".upper()

'HAMED AHMADI'

In [10]:
"hamed ahmadi".title()

'Hamed Ahmadi'

In [11]:
df["Name"].str.title()

0            Aaron,  Elvia J
1          Aaron,  Jeffery M
2             Aaron,  Karina
3        Aaron,  Kimberlei R
4        Abad Jr,  Vicente M
                ...
32058     Zygowicz,  Peter J
32059      Zymantas,  Mark E
32060    Zyrkowski,  Carlo E
32061    Zyskowski,  Dariusz
32062                    NaN
Name: Name, Length: 32063, dtype: object

In [12]:
df["Department"]=df["Department"].str.title()
df["Name"]=df["Name"].str.title()
df["Position Title"]=df["Position Title"].str.title()

In [13]:
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,$90744.00
1,"Aaron, Jeffery M",Police Officer,Police,$84450.00
2,"Aaron, Karina",Police Officer,Police,$84450.00
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,$89880.00
4,"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,$106836.00

In [14]:
#the len of each name
df["Name"].str.len()

0        15.0
1        17.0
2        14.0
3        19.0
4        19.0
         ...
32058    18.0
32059    17.0
32060    19.0
32061    19.0
32062     NaN
Name: Name, Length: 32063, dtype: float64

In [15]:
df.tail()

,Name,Position Title,Department,Employee Annual Salary
32058,"Zygowicz, Peter J",Police Officer,Police,$87384.00
32059,"Zymantas, Mark E",Police Officer,Police,$84450.00
32060,"Zyrkowski, Carlo E",Police Officer,Police,$87384.00
32061,"Zyskowski, Dariusz",Chief Data Base Analyst,Doit,$113664.00
32062,NaN,NaN,NaN,NaN

In [16]:
#dropping row that whole amonth are null
df=df.dropna(how="all")

In [17]:
df.tail()

,Name,Position Title,Department,Employee Annual Salary
32057,"Zygadlo, Michael J",Frm Of Machinists - Automotive,General Services,$99528.00
32058,"Zygowicz, Peter J",Police Officer,Police,$87384.00
32059,"Zymantas, Mark E",Police Officer,Police,$84450.00
32060,"Zyrkowski, Carlo E",Police Officer,Police,$87384.00
32061,"Zyskowski, Dariusz",Chief Data Base Analyst,Doit,$113664.00

# replace

In [18]:
#changing "i" with "e"
"hamid partovi".replace("i" ,"e")

'hamed partove'

In [19]:
#for changing original data  df["Department"]=df["Department"].str.replace("Police" , "Officer")
df["Department"].str.replace("Police" , "Officer")

0             Water Mgmnt
1                 Officer
2                 Officer
3        General Services
4             Water Mgmnt
               ...
32057    General Services
32058             Officer
32059             Officer
32060             Officer
32061                Doit
Name: Department, Length: 32062, dtype: object

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  object
 3   Employee Annual Salary  32062 non-null  object
dtypes: object(4)
memory usage: 1.2+ MB

In [21]:
df["Department"]=df["Department"].astype("category")

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  object
dtypes: category(1), object(3)
memory usage: 1.0+ MB

In [23]:
df["Employee Annual Salary"]=df["Employee Annual Salary"].str.replace("$","").astype("float")

C:\Users\Science Pillar\AppData\Local\Temp\ipykernel_10288\420749211.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df["Employee Annual Salary"]=df["Employee Annual Salary"].str.replace("$","").astype("float")

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32062 entries, 0 to 32061
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Name                    32062 non-null  object
 1   Position Title          32062 non-null  object
 2   Department              32062 non-null  category
 3   Employee Annual Salary  32062 non-null  float64
dtypes: category(1), float64(1), object(2)
memory usage: 1.0+ MB

In [25]:
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
1,"Aaron, Jeffery M",Police Officer,Police,84450.0
2,"Aaron, Karina",Police Officer,Police,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
4,"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,106836.0

# contains()

In [26]:
#the amounth that contains water
musk=df["Position Title"].str.lower().str.contains("water")
df[musk]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
554,"Aluise, Vincent G",Foreman Of Water Pipe Construction,Water Mgmnt,102440.0
671,"Ander, Perry A",Water Chemist Ii,Water Mgmnt,82044.0
685,"Anderson, Andrew J",District Superintendent Of Water Distribution,Water Mgmnt,109272.0
702,"Anderson, Donald",Foreman Of Water Pipe Construction,Water Mgmnt,102440.0
...,...,...,...,...
29669,"Verma, Anupam",Managing Engineer - Water Management,Water Mgmnt,111192.0
30239,"Washington, Joseph",Water Chemist Iii,Water Mgmnt,89676.0
30544,"West, Thomas R",Gen Supt Of Water Management,Water Mgmnt,115704.0
30991,"Williams, Matthew",Foreman Of Water Pipe Construction,Water Mgmnt,102440.0
31405,"Woodridge, Robert L",Foreman Of Water Pipe Construction,Water Mgmnt,102440.0

# startswith()

In [27]:
musk_2=df["Position Title"].str.lower().str.startswith("water")
df[musk_2]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
671,"Ander, Perry A",Water Chemist Ii,Water Mgmnt,82044.0
1054,"Ashley, Karma T",Water Chemist Ii,Water Mgmnt,82044.0
1079,"Atkins, Joanna M",Water Chemist Ii,Water Mgmnt,82044.0
1181,"Azeem, Mohammed A",Water Chemist Ii,Water Mgmnt,53172.0
...,...,...,...,...
28574,"Threatt, Denise R",Water Quality Inspector,Water Mgmnt,62004.0
28602,"Tignor, Darryl B",Water Rate Taker,Water Mgmnt,78948.0
28955,"Travis Cook, Leslie R",Water Rate Taker,Water Mgmnt,78948.0
29584,"Velazquez, John",Water Rate Taker,Water Mgmnt,78948.0
30239,"Washington, Joseph",Water Chemist Iii,Water Mgmnt,89676.0

# endswith()

In [28]:
musk_3=df["Position Title"].str.lower().str.endswith("er")
df[musk_3]

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
1,"Aaron, Jeffery M",Police Officer,Police,84450.0
2,"Aaron, Karina",Police Officer,Police,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
11,"Abbate, Terry M",Police Officer,Police,90618.0
...,...,...,...,...
32054,"Zych, Mateusz",Police Officer,Police,46668.0
32055,"Zydek, Bryan",Police Officer,Police,81588.0
32058,"Zygowicz, Peter J",Police Officer,Police,87384.0
32059,"Zymantas, Mark E",Police Officer,Police,84450.0
32060,"Zyrkowski, Carlo E",Police Officer,Police,87384.0

# lstrip() , rstip() , strip()

In [29]:
"     hello world    ".lstrip()

'hello world    '

In [30]:
"     hello world    ".rstrip()

'     hello world'

In [31]:
"     hello world    ".strip()

'hello world'

In [32]:
df["Name"]=df["Name"].str.strip()

In [33]:
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
1,"Aaron, Jeffery M",Police Officer,Police,84450.0
2,"Aaron, Karina",Police Officer,Police,84450.0
3,"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
4,"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,106836.0

In [34]:
df.set_index(keys="Name" , inplace=True )

In [35]:
df.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
"Aaron, Jeffery M",Police Officer,Police,84450.0
"Aaron, Karina",Police Officer,Police,84450.0
"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,106836.0

In [36]:
df["Position Title"]=df["Position Title"].str.strip()

In [37]:
df.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"Aaron, Elvia J",Water Rate Taker,Water Mgmnt,90744.0
"Aaron, Jeffery M",Police Officer,Police,84450.0
"Aaron, Karina",Police Officer,Police,84450.0
"Aaron, Kimberlei R",Chief Contract Expediter,General Services,89880.0
"Abad Jr, Vicente M",Civil Engineer Iv,Water Mgmnt,106836.0

In [38]:
df.index=df.index.str.strip().str.upper()

In [39]:
df.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",Water Rate Taker,Water Mgmnt,90744.0
"AARON, JEFFERY M",Police Officer,Police,84450.0
"AARON, KARINA",Police Officer,Police,84450.0
"AARON, KIMBERLEI R",Chief Contract Expediter,General Services,89880.0
"ABAD JR, VICENTE M",Civil Engineer Iv,Water Mgmnt,106836.0

# split  ,  get

In [40]:
#split it by space
"hello my name is tala".split(" ")

['hello', 'my', 'name', 'is', 'tala']

In [41]:
df.reset_index(inplace=True)
df.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",Water Rate Taker,Water Mgmnt,90744.0
1,"AARON, JEFFERY M",Police Officer,Police,84450.0
2,"AARON, KARINA",Police Officer,Police,84450.0
3,"AARON, KIMBERLEI R",Chief Contract Expediter,General Services,89880.0
4,"ABAD JR, VICENTE M",Civil Engineer Iv,Water Mgmnt,106836.0

In [42]:
df["Name"].str.split(",")

0            [AARON,   ELVIA J]
1          [AARON,   JEFFERY M]
2             [AARON,   KARINA]
3        [AARON,   KIMBERLEI R]
4        [ABAD JR,   VICENTE M]
                  ...
32057    [ZYGADLO,   MICHAEL J]
32058     [ZYGOWICZ,   PETER J]
32059      [ZYMANTAS,   MARK E]
32060    [ZYRKOWSKI,   CARLO E]
32061    [ZYSKOWSKI,   DARIUSZ]
Name: Name, Length: 32062, dtype: object

In [43]:
df["Name"].str.split(",").get(0)

['AARON', '  ELVIA J']

In [44]:
df["Name"].str.split(",").str.get(0).str.title()

0            Aaron
1            Aaron
2            Aaron
3            Aaron
4          Abad Jr
           ...
32057      Zygadlo
32058     Zygowicz
32059     Zymantas
32060    Zyrkowski
32061    Zyskowski
Name: Name, Length: 32062, dtype: object

In [45]:
df["Name"].str.split(",").str.get(0).str.title().value_counts()

Williams     293
Johnson      244
Smith        241
Brown        185
Jones        183
            ...
Horkavy        1
Horn           1
Horne Jr       1
Horner         1
Zyskowski      1
Name: Name, Length: 13829, dtype: int64

In [46]:
df["Department"].str.split(" ").str.get(1)

0           Mgmnt
1             NaN
2             NaN
3        Services
4           Mgmnt
           ...
32057    Services
32058         NaN
32059         NaN
32060         NaN
32061         NaN
Name: Department, Length: 32062, dtype: object

In [47]:
#expand giving us a dataframe
df[["l_Name" , "f_Name"]]=df["Name"].str.split("," , expand=True).head()

In [48]:
df.head()

,Name,Position Title,Department,Employee Annual Salary,l_Name,f_Name
0,"AARON, ELVIA J",Water Rate Taker,Water Mgmnt,90744.0,AARON,ELVIA J
1,"AARON, JEFFERY M",Police Officer,Police,84450.0,AARON,JEFFERY M
2,"AARON, KARINA",Police Officer,Police,84450.0,AARON,KARINA
3,"AARON, KIMBERLEI R",Chief Contract Expediter,General Services,89880.0,AARON,KIMBERLEI R
4,"ABAD JR, VICENTE M",Civil Engineer Iv,Water Mgmnt,106836.0,ABAD JR,VICENTE M

In [49]:
df["Position Title"].str.split(" " ,expand=True )

,0,1,2,3,4,5,6,7,8
0,Water,Rate,Taker,None,None,None,None,None,None
1,Police,Officer,None,None,None,None,None,None,None
2,Police,Officer,None,None,None,None,None,None,None
3,Chief,Contract,Expediter,None,None,None,None,None,None
4,Civil,Engineer,Iv,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...
32057,Frm,Of,Machinists,-,Automotive,None,None,None,None
32058,Police,Officer,None,None,None,None,None,None,None
32059,Police,Officer,None,None,None,None,None,None,None
32060,Police,Officer,None,None,None,None,None,None,None
32061,Chief,Data,Base,Analyst,None,None,None,None,None

In [50]:
df["Position Title"].str.split(" " ,expand=True , n=1 )

            0                           1
0       Water                  Rate Taker
1      Police                     Officer
2      Police                     Officer
3       Chief          Contract Expediter
4       Civil                 Engineer Iv
...       ...                         ...
32057     Frm  Of Machinists - Automotive
32058  Police                     Officer
32059  Police                     Officer
32060  Police                     Officer
32061   Chief           Data Base Analyst

[32062 rows x 2 columns]

In [51]:
df["Position Title"].str.split(" " ,expand=True , n=2 )

            0         1                        2
0       Water      Rate                    Taker
1      Police   Officer                     None
2      Police   Officer                     None
3       Chief  Contract                Expediter
4       Civil  Engineer                       Iv
...       ...       ...                      ...
32057     Frm        Of  Machinists - Automotive
32058  Police   Officer                     None
32059  Police   Officer                     None
32060  Police   Officer                     None
32061   Chief      Data             Base Analyst

[32062 rows x 3 columns]

# multy index

In [74]:
#parse_dates changing the type of it to datetime
#data=pd.read_csv("D:\\tala\\pandas\\bigmac.csv" , parse_dates=["Date"] , index_col=["Date" ,"Country"])
data=pd.read_csv("D:\\tala\\pandas\\bigmac.csv" , parse_dates=["Date"])
#data.sort_index(inplace=True)
data.head()

        Date    Country  Price in US Dollars
0 2016-01-01  Argentina                 2.39
1 2016-01-01  Australia                 3.74
2 2016-01-01     Brazil                 3.35
3 2016-01-01    Britain                 4.22
4 2016-01-01     Canada                 4.14

In [75]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652 entries, 0 to 651
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Date                 652 non-null    datetime64[ns]
 1   Country              652 non-null    object
 2   Price in US Dollars  652 non-null    float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 15.4+ KB

In [76]:
data.nunique()

Date                    12
Country                 58
Price in US Dollars    330
dtype: int64

In [77]:
#with is uniques less goes to outer layer
data.set_index(keys=["Date" , "Country"] ,inplace=True)

In [78]:
#first proirty in sorting is date
data.sort_index()

                          Price in US Dollars
Date       Country
2010-01-01 Argentina                     1.84
           Australia                     3.98
           Brazil                        4.76
           Britain                       3.67
           Canada                        3.97
...                                       ...
2016-01-01 Ukraine                       1.54
           United States                 4.93
           Uruguay                       3.74
           Venezuela                     0.66
           Vietnam                       2.67

[652 rows x 1 columns]

In [81]:
data.index.get_level_values(0)

DatetimeIndex(['2016-01-01', '2016-01-01', '2016-01-01', '2016-01-01',
               '2016-01-01', '2016-01-01', '2016-01-01', '2016-01-01',
               '2016-01-01', '2016-01-01',
               ...
               '2010-01-01', '2010-01-01', '2010-01-01', '2010-01-01',
               '2010-01-01', '2010-01-01', '2010-01-01', '2010-01-01',
               '2010-01-01', '2010-01-01'],
              dtype='datetime64[ns]', name='Date', length=652, freq=None)

In [82]:
data.index.get_level_values(1)

Index(['Argentina', 'Australia', 'Brazil', 'Britain', 'Canada', 'Chile',
       'China', 'Colombia', 'Costa Rica', 'Czech Republic',
       ...
       'Sri Lanka', 'Sweden', 'Switzerland', 'Taiwan', 'Thailand', 'Turkey',
       'UAE', 'Ukraine', 'United States', 'Uruguay'],
      dtype='object', name='Country', length=652)

# changing the names of index

In [83]:
data.index.set_names(names=["days" ,"location"])#inplace=True   by inplace it changes to be dataframe too
#data.index.set_names(names="dates" , level=0 ,inplace=True)
#data.index.set_names(names="location" , level=1 ,inplace=True)

MultiIndex([('2016-01-01',      'Argentina'),
            ('2016-01-01',      'Australia'),
            ('2016-01-01',         'Brazil'),
            ('2016-01-01',        'Britain'),
            ('2016-01-01',         'Canada'),
            ('2016-01-01',          'Chile'),
            ('2016-01-01',          'China'),
            ('2016-01-01',       'Colombia'),
            ('2016-01-01',     'Costa Rica'),
            ('2016-01-01', 'Czech Republic'),
            ...
            ('2010-01-01',      'Sri Lanka'),
            ('2010-01-01',         'Sweden'),
            ('2010-01-01',    'Switzerland'),
            ('2010-01-01',         'Taiwan'),
            ('2010-01-01',       'Thailand'),
            ('2010-01-01',         'Turkey'),
            ('2010-01-01',            'UAE'),
            ('2010-01-01',        'Ukraine'),
            ('2010-01-01',  'United States'),
            ('2010-01-01',        'Uruguay')],
           names=['days', 'location'], length=652)

In [84]:
data.head()

                      Price in US Dollars
Date       Country
2016-01-01 Argentina                 2.39
           Australia                 3.74
           Brazil                    3.35
           Britain                   4.22
           Canada                    4.14

In [86]:
#df.sort_index(ascending=[True , False])

In [90]:
data.iloc[[1 , 5 ,9]]
#data.loc["2016-01-01"]

                           Price in US Dollars
Date       Country
2016-01-01 Australia                      3.74
           Chile                          2.94
           Czech Republic                 2.98

# transpose()

In [91]:
#changing the rows and columns place
data=data.transpose()
data.head()

Date                2016-01-01                                              \
Country              Argentina Australia Brazil Britain Canada Chile China
Price in US Dollars       2.39      3.74   3.35    4.22   4.14  2.94  2.68

Date                                                    ... 2010-01-01         \
Country             Colombia Costa Rica Czech Republic  ...  Sri Lanka Sweden
Price in US Dollars     2.43       4.02           2.98  ...       1.83   5.51

Date                                                                  \
Country             Switzerland Taiwan Thailand Turkey   UAE Ukraine
Price in US Dollars         6.3   2.36     2.11   3.83  2.99    1.83

Date
Country             United States Uruguay
Price in US Dollars          3.58    3.32

[1 rows x 652 columns]

In [94]:
data=data.transpose()
data.head()

                      Price in US Dollars
Date       Country
2016-01-01 Argentina                 2.39
           Australia                 3.74
           Brazil                    3.35
           Britain                   4.22
           Canada                    4.14

# swaplevel()

In [95]:
#changing the place of two indexes
data.swaplevel()
#if it be more than two indexes we have to define which two indexes
#data.swaplevel("Date","Country")

                          Price in US Dollars
Country       Date
Argentina     2016-01-01                 2.39
Australia     2016-01-01                 3.74
Brazil        2016-01-01                 3.35
Britain       2016-01-01                 4.22
Canada        2016-01-01                 4.14
...                                       ...
Turkey        2010-01-01                 3.83
UAE           2010-01-01                 2.99
Ukraine       2010-01-01                 1.83
United States 2010-01-01                 3.58
Uruguay       2010-01-01                 3.32

[652 rows x 1 columns]